if GetLocale() ~= "ruRU" then return end

IMAGOdb.timelines.LORTHEMAR_THERON = {
    {
        era = "WC2",
        text = [[Защитил Луносвет под командованием Сильваны Ветрокрылой и был повышен до командира следопытов.]],
    },
    {
        era = "WC3",
        text = [[Пережив разрушение Кель'Таласа, Принц Кель'Тас назначил его Лордом-регентом. Отбил Луносвет от сил Плети.]],
    },
    {
        era = "TBC",
        text = [[Под его руководством эльфы крови вступили в Орду. Принял решение изгнать высших эльфов. Противостоял Кель'Тасу после его предательства. После гражданской войны, остался править в роли Лорда-регента.]],
    },
    {
        era = "WotLK",
        text = [[Неохотно отправил силы эльфов крови в Нордскол для помощи Орде в борьбе с Королем-Личем и помог восстановить древний клинок Кель'Делар.]],
    },
    {
        era = "Pre-MoP",
        text = [[Отказался лично принимать участие в атаке на Терамор, тем самым навлекая на себя гнев Гарроша Адского Крика.]],
    },
    {
        era = "MoP",
        text = [[Несогласный с руководством Гарроша, вел переговоры с Королем Варианом Ринном о повторном вступлении в Альянс. После Чистки Даларана, решил остаться в Орде и сыграл ключевую роль в восстании против Гарроша Адского Крика.]],
    },
    {
        era = "BfA",
        text = [[Пригласил Ночнорожденных в Орду. Лично руководил силами Орды в капании против Королевы Азшары и присоединился к восстунию против Сильваны Ветрокрылой. После Четвертой войны, стал одним из руководителей новосформированного Совета Орды.]],
    },
    {
        era = "Pre-DF",
        text = [[Женился на Талисре и пригласил на свадьбу лидеров как Орды, так и Альянса в знак мира между фракциями.]],
    },
    {
        era = "DF",
        text = [[Присоединился к защите Амирдрассила.]],
    },
    {
        era = "Midnight",
        text = [[Руководит силами эльфов крови в защите Луносвета от Бездны.]],
    }
}

IMAGOdb.timelines.VINDICATOR_BOROS = {
    {
        era = "TBC",
        text = [[Победил предательницу Сиронас, спасая беженцев-дренеев на Острове Кровавой Дымки от демонического развращения. Позже помог восстановить ландшафт вокруг места крушения Экзодара.]],
    },
    {
        era = "Legion",
        text = [[Присягнул Длани Аргуса на верность Ордену Серебряной Длани. Защищал Экзодар и Храм Света Пустоты от Пылающего Легиона. Работал вместе с жрецами и охотниками на демонов, чтобы спасти своих товарищей-паладинов. Позже сражался с Легионом на их родной планете Аргус.]],
    },
    {
        era = "DF",
        text = [[Присутствовал при воскрешении Тира. Участвовал в первом празднике дренеев Тишамаат в Азероте.]],
    },
    {
        era = "Midnight",
        text = [[Помогал защищать Солнечный Колодец от сил Бездны.]],
    }
}

IMAGOdb.timelines.GENERAL_AMIAS_BELLAMY =  {
    {
        era = "Pre-Legion",
        text = [[Присоединилась к экспедиции Арати по велению видения их императора. Выжила в плавании и оказалась в Тайносводье, где сражалась как паладин, защищая кристалл Беледар и побеждая любого врага, посягающего на их новый дом.]],
    },
    {
        era = "Midnight",
        text = [[Была призвана Солнечным Колодцем и защищала его в качестве генерала Авангарда Света под командованием Туралиона. Была недовольна недостаточной поддеркой жителей Луносвета Авангарду. Присоединилась к штурму Шпиля Пустоты Ксал'атат и настолько ослепла от света, что начала атаковать своих собственных союзников. Была убита Туралионом и героями Азерота.]],
    }
}

IMAGOdb.timelines.EADRIC_THE_PURE = {
    {
        era = "WotLK",
        text = [[Служил в Серебряном Авангарде под командованием Тириона Фордринга в качестве Абсолютного Чемпиона. Отвечал за организацию Серебряного турнира в северной части Ледяной Короны, обеспечивая безопасность и снабжение площадки, а также контролируя подготовку участников. Служил интендантом и время от времени сам участвовал в турнире в качестве бойца.]],
    },
    {
        era = "Legion",
        text = [[Присоединился к реформированным рыцарям Серебряной Длани и служил интендантом в Часовне Последней Надежды.]],
    },
    {
        era = "Pre-SL",
        text = [[Сдерживал разбушевавшуюся Плеть в Нордсколе.]],
    },
    {
        era = "Midnight",
        text = [[Был призван Солнечным Колодцем и сражался с Бездной на Площади Паргелия.]],
    }
}

IMAGOdb.timelines.FIONA = {
    {
        era = "Cata",
        text = [[Путешествовала по Восточным Чумным Землям вместе с Таренаром и Гидвином. Останавливалась много раз и помогала паладинам по всему региону, прежде чем на время обосноваться в Часовне Последней Надежды. По пути завела нескольких друзей и знакомых, таких как Аргус Путеводный, призрак Памелы Редпат и Векс'тул.]],
    },
    {
        era = "WoD",
        text = [[Отправилась в Дренор и помогла справиться с угрозой ботани в Долине Призрачной Луны. На время оставила караван в гарнизоне Зашедшей Луны, чтобы помочь командиру Альянса. Заинтересовалась просмотром боев в колизее огров в Верховном Молоте.]],
    },
    {
        era = "BfA",
        text = [[Отправилась в Боралус и на время открыла там лавку.]],
    },
    {
        era = "DF",
        text = [[Присоединилась к Драконьей Экспедиции и исследовала Драконьи Острова на своем караване.]],
    },
    {
        era = "Midnight",
        text = [[Была призвана Солнечным Колодцем и сражалась на острове Кель'Данас.]],
    }
}

IMAGOdb.timelines.YALIA_SAGEWHISPER = {
    {
        era = "Pre-WC3",
        text = [[Оставила свой дом и семью, не видя иного выхода, когда два юных мальчика-пандарена вступили в бесконечное соперничество за право жениться на ней в будущем. В пятилетнем возрасте вступила в орден Шадо-Пан.]],
    },
    {
        era = "MoP",
        text = [[Став старшим членом Шадо-Пан, курировала обучение новобранцев. Защищала Танлунские степи от проявлений Ша во времена конфликта Альянса с Ордой в Пандарии. Воссоединилась со своей семьей и защищала монастырь Шадо-Пан от натиска Зандаларов. Познакомилась с Чэнем Буйным Портером, и они полюбили друг друга.]],
    },
    {
        era = "Legion",
        text = [[Была принята Пророком Веленом в Конклав в качестве алхимика. Помогала защищать Храм Света Пустоты.]],
    },
    {
        era = "Midnight",
        text = [[Была призвана Солнечным Колодцем для помощи в защите от Бездны.]],
    }
}

IMAGOdb.timelines.LOTHRAXION = {
    {
        era = "Ancient",
        text = [[В рядах Пылающего Легиона помогал уничтожать бесчисленные миры по всей Великой Запредельной Тьме. Отрёкся от демонов и своих сородичей-натрезимов после встречи с дренеями. Присоединился к Армии Света, присягнув на верность Зе’ре, Матери Света, и был наполнен самим Светом.]],
    },
    {
        era = "Pre-WC3",
        text = [[После разрушения Дренора завербовал Туралиона и Аллерию Ветрокрылую в Армию Света. Когда Аллерия была заражена Бездной, помог ей сохранить рассудок и даже убедил Зе’ру не казнить её. Сражался бок о бок с верховным экзархом Туралионом на Аргусе.]],
    },
    {
        era = "Legion",
        text = [[Был захвачен и заключён в тюрьму в демоническом мире Нискара, но был спасён Верховным лордом Серебряной Длани. Помогал защищать Храм Света Пустоты. Присоединился к силам Азерота на Виндикаре, чтобы вернуться в бой на Аргусе. После поражения Пылающего Легиона ушёл сражаться с демонами в других уголках космоса.]],
    },
    {
        era = "Midnight",
        text = [[Был призван Солнечным Колодцем для защиты от Пожирающего сонма. Присоединился к Аллерии и Умбрию в штурме Бури Бездны. Обратился к радикальным методам борьбы с Бездной, подвергая опасности союзников ради достижения своей цели. Был убит своими союзниками, когда его рвение угрожало уничтожить весь Луносвет.]],
    }
}

IMAGOdb.timelines.APONI_BRIGHTMANE = {
    {
        era = "WotLK",
        text = [[Сражалась в Нордсколе в роли воина против армий Короля-лича, но была тяжело ранена и вернулась в Громовой Утёс. Здесь она и Таху Мудрый Ветер заложили основу для создания первых орденов паладинов и жрецов среди тауренов. После излечения Апони вернулась на войну и теперь сражалась со Светом Ан'ше на своей стороне.]],
    },
    {
        era = "Cata",
        text = [[Официально сформировала орден паладинов «Служители Солнца» и была главным инструктором для новых рекрутов среди тауренов. Она помогала защищать Громовой Утёс от разбушевавшихся элементалей.]],
    },
    {
        era = "Legion",
        text = [[Объединила силы с орденом Серебряной Длани. Безуспешно пыталась выследить демона Бальназара, но была захвачена в процессе, и её пришлось спасать Верховному лорду. Помогала защищать Храм Света Пустоты и Экзодар от Пылающего Легиона.]],
    },
    {
        era = "BfA",
        text = [[Когда орден Серебряной Длани распался из-за конфликта фракций во времена Четвёртой войны, Апони вернулась в Громовой Утёс, чтобы вновь обучать новых рекрутов.]],
    },
    {
        era = "DF",
        text = [[Присоединилась к Драконьей экспедиции на Драконьих островах и стала другом и сторонником кентавров Тиракая.]],
    },
    {
        era = "TWW",
        text = [[Узнав о разрушении Даларана, сражалась против войск Ксал’атат на Острове Дорн.]],
    },
    {
        era = "Midnight",
        text = [[Была призвана Солнечным Колодцем для защиты от Бездны.]],
    }
}

IMAGOdb.timelines.MEHLAR_DAWNBLADE = {
    {
        era = "Pre-WC3",
        text = [[Обучался у Утера Светоносного пути рыцаря Серебряной Длани.]],
    },
    {
        era = "WC3",
        text = [[Сражался с Плетью на многих фронтах. Присоединился к Рыцарям Крови.]],
    },
    {
        era = "TBC",
        text = [[Осквернил гробницу Утера и столкнулся с духом своего наставника. Осознал, что ярость и насилие - не те эмоции, которыми он хочет руководствоваться. Вместе с Сильваной Ветрокрылой создал Руну проклятия Плети.]],
    },
    {
        era = "WoD",
        text = [[Последовал за леди Лиадрин на Дренор. Помогал ей защищать Аукиндон от Совета Теней.]],
    },
    {
        era = "Legion",
        text = [[Вновь отправился к гробнице Утера, чтобы защитить её от беспокойных духов. Ненадолго вернулся в Серебряную Длань, когда леди Лиадрин присягнула своих Рыцарей Крови новому Верховному лорду.]],
    },
    {
        era = "DF",
        text = [[Присутствовал при возрождении Тира и ордена Стражей Тира.]],
    },
    {
        era = "TWW",
        text = [[Помогал обучать новых добровольцев-земельников для Орды.]],
    },
    {
        era = "Midnight",
        text = [[Получил ранение во время первоначального штурма Солнечного Колодца. Позже вновь присоединился к Авангарду Света в борьбе с Бездной.]],
    }
}

IMAGOdb.timelines.PROPHET_VELEN = {
    {
        era = "Ancient",
        text = [[Правил Аргусом в составе Триумвирата с Кил’джеденом и Архимондом. Отверг предложение Саргераса и покинул планету со своими последователями, вызвав гнев Кил’джедена и положив начало тысячелетней охоте.]],
    },
    {
        era = "Pre-WC1",
        text = [[Потерпел крушение на корабле Генедар на планете Дренор. Наладил связь с местным народом - орками. Назвал свой народ дренеями - изгнанными. Пережил геноцид своего народа от рук орков, извращённых Кил’джеденом. Едва сбежал с горсткой своих людей.]],
    },
    {
        era = "WC2",
        text = [[Пережил разрушение Запределья, устроенное Нер’зулом, наблюдая, как его новый дом был втянут в Круговерть Пустоты.]],
    },
    {
        era = "WC3",
        text = [[Разработал план захвата корабля наару Экзодар, который находился в руках Кель’таса Солнечного Скитальца. После обнаружения дренеев и саботажа двигателя корабля эльфами бесцельно летал по Круговерти Пустоты в течение многих лет.]],
    },
    {
        era = "Pre-TBC",
        text = [[Совершил аварийную посадку на острове Лазурной Дымки в Калимдоре на Азероте. Узнав, что Азерот населён теми самыми орками, которые погубили его народ, присоединился к Альянсу, найдя утешение в почитании Света многими его расами.]],
    },
    {
        era = "TBC",
        text = [[Убедил своих новых союзников принять участие в штурме Запределья и сорвать планы Пылающего Легиона. После поражения Кил’джедена на плато Солнечного Колодца восстановил осквернённый Солнечный Колодец с помощью оставшегося фрагмента падшего наару М’ууру. Вдохновил леди Лиадрин и её Рыцарей Крови использовать Свет более ответственно в будущем.]],
    },
    {
        era = "Pre-Cata",
        text = [[После предупреждения от дренеев-шаманов о землетрясениях и беспокойстве стихий, подобных тем, что были на Дреноре, задумался о покидании Азерота. Устав от бегства, объявил Азерот новым домом дренеев и поклялся впредь сражаться за него.]],
    },
    {
        era = "Cata",
        text = [[Присутствовал на встрече лидеров Альянса в Дарнасе. Согласился на просьбу молодого Андуина Ринна взять его в ученики и научить путям Света. Увидел видение пожилого Андуина, ведущего армии всего Азерота в финальную битву против всепоглощающей тьмы.]],
    },
    {
        era = "MoP",
        text = [[Исцелил Андуина Ринна вместе с монахами-пандаренами после того, как принц был ранен, пытаясь в одиночку остановить Гарроша Адского Крика.]],
    },
    {
        era = "Legion",
        text = [[Защищал Экзодар и был вынужден смотреть, как умирает его собственный сын Ракиш. Принял участие во втором штурме Расколотого Берега. Сразился с Кил’джеденом в финальной битве в Круговерти Пустоты. Вместе с Иллиданом Яростью Бури и Кадгаром возглавил войска Азерота на Аргусе и наконец стал свидетелем поражения Пылающего Легиона.]],
    },
    {
        era = "BfA",
        text = [[Принял участие в исцелении Азерота от ран, нанесённых мечом Саргераса. Лично оказывал помощь беженцам из Тельдрассила.]],
    },
    {
        era = "DF",
        text = [[Организовал первый праздник Тишамаат, впервые объединив дранеев, сломленных и эредаров на Азероте. Лично помог защитить Амирдрассил от Фиракка.]],
    },
    {
        era = "Midnight",
        text = [[Был призван Солнечным Колодцем для защиты от Бездны. Руководил поддержкой Солнечного Колодца и был единственным, кому не требовались магические подкрепления, чтобы продолжать направлять Свет.]],
    }
}

IMAGOdb.timelines.CALIA_MENETHIL = {
    {
        era = "WC2",
        text = [[В 16 лет против своей воли обручена с альтеракским дворянином, лордом Давалом Престором - замаскированным драконом Смертокрылом. После исчезновения Престора осталась незамужней.]],
    },
    {
        era = "Pre-WC3",
        text = [[Влюбилась в простого пехотинца армии Лордерона и забеременела от него.]],
    },
    {
        era = "WC3",
        text = [[По чистой случайности пережила падение Лордерона и смогла бежать вместе с мужем и дочерью. Тайно жила с семьёй в Южнобережье. После нападения на город оказалась разлучена со своей семьёй.]],
    },
    {
        era = "Pre-Legion",
        text = [[Незадолго до третьего вторжения Пылающего Легиона встретила Алонсия Фаола, который показал ей разницу между безмозглой Плетью и нежитью Отрекшихся. В надежде найти свою семью среди Отрекшихся присоединилась к Алонсию.]],
    },
    {
        era = "Legion",
        text = [[Присоединилась к Конклаву и помогла Фаолу вернуть бога Бездны Сарака Пожирателя Света в оригинальную форму наару - Саа’ру. Помогла защитить Экзодар от Пылающего Легиона.]],
    },
    {
        era = "Pre-BfA",
        text = [[Вновь появилась на публике и была признана королём Андуином Ринном законной правительницей Лордерона. Присоединилась к Встрече, надеясь снова встретить свою семью. Раскрыла себя, призывая Отрекшихся вновь присоединиться к Альянсу. В последовавшей за этим резне была убита. Была воскрешена Саа’рой и Андуином как нежить Света.]],
    },
    {
        era = "BfA",
        text = [[После окончания Четвёртой войны подружилась с Дереком Праудмуром, который также был превращён в нежить. Присоединилась к Орде и заявила, что хочет не только помочь своему народу, но и реабилитировать имя Менетилов.]],
    },
    {
        era = "Pre-SL",
        text = [[Стала советницей Отрекшихся и вошла в правящий Совет Орды. Сопровождала Тралла в дипломатической миссии к руинам Тельдрассила.]],
    },
    {
        era = "SL",
        text = [[Отправилась в Темные Земли, чтобы помочь в кампании против Тюремщика. Сыграла ключевую роль в освобождении Подгорода от порчи Четвёртой войны, лично используя свой Свет в качестве щита для борьбы с остаточным ядом. Присоединилась к Мрачному Совету в качестве одного из его лидеров. Взяла Дерека Праудмура в качестве своего чемпиона и поклялась вывести войска Отрекшихся из Гилнеаса.]],
    },
    {
        era = "DF",
        text = [[Руководила контратакой Отрекшихся после того, как Алый Орден двинулся на Подгород. Вывела войска Отрекшихся из Руин Гилнеаса. Помогла королю Генну Седогриву и принцессе Тесс освободить город воргенов от оккупации Алого Ордена.]],
    },
    {
        era = "Midnight",
        text = [[Была призвана Солнечным Колодцем и защищала Луносвет.]],
    }
}

IMAGOdb.timelines.CAPTAIN_FAREEYA = {
    {
        era = "Ancient",
        text = [[Сбежала с Аргуса на корабле «Генедар» вместе с Пророком Веленом, когда эредары присоединились к Пылающему Легиону. Захватила другой космический корабль - «Ксенедар» - и отправилась обратно в Круговерть Пустоты. Под командованием наару Зе'ры стала Озарённой и возглавила Армию Света.]],
    },
    {
        era = "Legion",
        text = [[Сражалась на передовой во время штурма Анторуса. Помогла героям Азерота раз и навсегда покончить с Пылающим Легионом на Аргусе.]],
    },
    {
        era = "BfA",
        text = [[Решительно одобрила решение Верховного экзарха Туралиона присоединить Армию Света к Альянсу. Воссоединилась с Веленом и своим народом и начала обучать новых Озарённых из числа дренеев Азерота. Сражалась в Четвёртой войне.]],
    },
    {
        era = "DF",
        text = [[Присутствовала на первом праздновании Тишамаата на Азероте.]],
    },
    {
        era = "TWW",
        text = [[Отправилась в Тайносводье, чтобы лицезреть Свет Беледара, и вдохновила юных Арати своим мастерством в обращении со Светом.]],
    },
    {
        era = "Midnight",
        text = [[Помогла защитить Солнечный Колодец от Бездны.]],
    }
}

IMAGOdb.timelines.LORD_SALTHERIL = {
    {
        era = "Pre-WC2",
        text = [[Изгнал Сильвану Ветрокрылую из своих владений после того, как она устроила скандал на одной из его вечеринок, подмешав в напитки раневое дерево и временно парализовав его язык.]],
    },
    {
        era = "TBC",
        text = [[Продолжал устраивать вечеринки и окружать себя льстецами, несмотря на обвинения в том, что он уклоняется от реальности ситуации в Кель'Таласе.]],
    },
    {
        era = "Midnight",
        text = [[Открыл свои владения для Магистров, Странников, Рыцарей Крови и даже злодеев из Закоулка Душегубов для мероприятия, которое он называет «Званый ужин у Салтерила».]],
    }
}

IMAGOdb.timelines.LADY_DARKGLEN = {
    {
        era = "DF",
        text = [[Помогала защищать Телогрус от Темной Стражи.]],
    },
    {
        era = "TWW",
        text = [[Сражалась на Кареше против войск Пространствуса. Выполняла контракты Брокеров Тазавеша.]],
    },
    {
        era = "Midnight",
        text = [[Остановила распространение мутировавшего патогена в Распадке и успешно излечила рен’дорай от этой болезни. Сражалась в Шпиле Пустоты. Исследовала места проведения ритуалов раздробленных сил Бездны после восстановления Рассветного Колодца.]],
    }
}

IMAGOdb.timelines.HIGH_INQUISITOR_WHITEMANE = {
    {
        era = "Pre-Classic",
        text =[[Став свидетелем того, как её семья поддалась чуме нежити в Лордероне, была вынуждена уничтожить их, когда они воскресли в составе Плети. Присоединилась к Алому Ордену, чтобы положить конец угрозе нежити.]],
    },
    {
        era = "Classic",
        text = [[Поднялась до звания Верховного инквизитора. Пережила попытки уничтожить руководство Алого Ордена, предпринятые группами искателей приключений, совершавшими набеги на Монастырь Алого Ордена, и ушла в подполье.]],
    },
    {
        era = "Mists of Pandaria",
        text = [[Вернулась, чтобы возглавить войска Алого Ордена. В конце концов была убита Лилиан Восс и группой искателей приключений.]],
    },
    {
        era = "Legion",
        text = [[Воскрешена Рыцарями Чёрного Клинка в качестве третьего из Четырёх Всадников. Помогала отражать атаки Пылающего Легиона вместе с другими всадниками на Расколотом Берегу.]],
    },
    {
        era = "Battle for Azeroth",
        text = [[Занималась поиском павших героев Орды и Альянса и воскрешала их в качестве нового поколения рыцарей смерти.]],
    },
    {
        era = "SL",
        text = [[Выступала в качестве посланника Чёрного Клинка в Альянсе. Помогала в штурме Святилища Господства. Вернулась в Азерот, чтобы помочь Чёрному Клинку сдерживать Плеть.]],
    },
    {
        era = "Midnight",
        text = [[Защищала Часовню Последней Надежды от Плети вместе с остальными Четырьмя Всадниками.]],
    },
}

IMAGOdb.timelines.THORAS_TROLLBANE = {
    {
        era = "Pre-WC2",
        text = [[Возглавлял армии Стромгарда в нескольких войнах с королевством Альтерак.]],
    },
    {
        era = "WC2",
        text = [[Присоединился к Альянсу Лордерона в качестве одного из основателей, защищая северные земли от вторжения Орды через захваченное королевство дворфов Каз Модан. Позже он и его армии помогли снять осаду с Лордерона, не дав войскам Орды прорваться через Альтеракские горы. После войны был убит своим сыном Галеном.]],
    },
    {
        era = "Legion",
        text = [[Воскрешён Рыцарями Чёрного Клинка в качестве одного из Четырёх Всадников. Принял участие в штурме Алого Монастыря и сражении с демонами на Расколотом Берегу.]],
    },
    {
        era = "BfA",
        text = [[Занимался поиском павших героев Орды и Альянса и воскрешал их в качестве нового поколения рыцарей смерти.]],
    },
    {
        era = "SL",
        text = [[Сопровождал Болвара Фордрагона и отряд героев в атаке на Святилище Господства.]],
    },
    {
        era = "Midnight",
        text = [[Помогал в обороне Часовни Последней Надежды, пока Серебряный Авангард был занят обороной Солнечного Колодца.]],
    }
}

IMAGOdb.timelines.KOLTIRA_DEATHWEAVER = {
    {
        era = "WC3",
        text = [[Пал от меча Тассариана при обороне Луносвета. Был воскрешен как Рыцарь Смерти и был вынужден сражаться за Плеть.]],
    },
    {
        era = "WotLK",
        text = [[Освободился от контроля Короля-Лича и поклялся защищать Азерот в составе новообразованного Черного Клинка. Присоединился к Орде и сражался в Нордсколе, используя свой опыт Рыцаря Смерти при штурма крепости Короля-Лича - Цитадели Ледяной Короны.]],
    },
    {
        era = "Cata",
        text = [[Был заключен Сильваной Ветрокрылой в Подгороде за попытку заключить перемирие между Ордой и Альянсом во время битвы при Андорале.]],
    },
    {
        era = "Legion",
        text = [[Освобожден из плена Тассарианом и впоследствии присоединился к борьбе против Пылающего Легиона.]],
    },
    {
        era = "SL",
        text = [[Последовал за Болваром Фордрагоном в Темные Земли, чтобы сразиться с Сильваной.]],
    },
    {
        era = "Midnight",
        text = [[Помогал защищать Часовню Последней Надежды.]],
    }
}

IMAGOdb.timelines.NAZGRIM = {
    {
        era = "Pre-WC3",
        text = [[Был захвачен Альянсом и содержался в плену в лагерях для интернированных. После освобождения Ордой он присоединился к армии Тралла.]],
    },
    {
        era = "WotLK",
        text = [[Служил сержантом в Крепости Завоевателей в Седых Холмах.]],
    },
    {
        era = "Cata",
        text = [[Был повышен до звания легионера и возглавил кампанию Орды в Вайш’ире.]],
    },
    {
        era = "MoP",
        text = [[Был повышен до звания генерала и получил приказ взять под контроль недавно открытые земли Пандарии. Взял под своё командование местных хозенов и вступил в столкновение с войсками адмирала Тейлора, что привело к разрушению Змеиного Сердца и освобождению ша. Позже был призван Гаррошем и получил задание защищать главные ворота Оргриммара от мятежников Орды и войск Альянса, где в итоге и погиб.]],
    },
    {
        era = "Legion",
        text = [[Был воскрешён новым Владыкой смерти и Тассарианом как первый член новых Четырёх Всадников.]],
    },
    {
        era = "SL",
        text = [[Стал посланником Чёрного Клинка в Орде. Сопровождал Болвара Фордрагона во время атаки на Святилище Господства.]],
    },
    {
        era = "DF",
        text = [[Принял участие в первом Кош’арге на Азероте в составе клана Песни Войны.]],
    },
    {
        era = "Midnight",
        text = [[Помогал защищать Часовню Последней Надежды.]],
    }
}

IMAGOdb.timelines.HALAZZI = {
    {
        era = "TBC",
        text = [[Его сущность была похищена Повелителем проклятий Малакрассом и вложена в Куриндже Тень. Его дух был освобождён, когда герои Орды победили Зул’Джина.]],
    },
    {
        era = "WotLK",
        text = [[Был среди других лоа Амани, которых вызвал Знахарь Кхуфу в Зул’Драке, чтобы попросить совета о спасении лоа Драккари.]],
    },
    {
        era = "Cata",
        text = [[Его сущность была снова украдена Повелителем проклятий Малакрассом и использована для создания аватара лоа. Его дух был освобождён, когда Даакара был побеждён искателями приключений.]],
    },
    {
        era = "Midnight",
        text = [[Вернулся в качестве главного лоа племени Сухокожих и вновь даровал свои силы лесным троллям, чтобы отбросить Бездну из Зул’Амана.]],
    }
}

IMAGOdb.timelines.FILO = {
    {
        era = "Midnight",
        text = [[Заботился о Канзе, ребенке из племени Амани, которая обратилась к нему в попытке воссоединиться с духом своей сестры-близнеца. Фило предоставил свою силу искателю приключений, который помог подготовить ритуал, при условии, что они не будут беспокоить его детей.]],
    }
}

IMAGOdb.timelines.ALLERIA_WINDRUNNER = {
    {
        era = "Pre-WC2",
        text = [[Отказавшись от звания будущего генерала следопытов Луносвета, покинула родину, чтобы увидеть мир за ее пределами. Установила контакты и нашла союзников в Альянсе Лордерона. Потеряла родителей от рук Орды.]],
    },
    {
        era = "WC2",
        text = [[Успешно защитила Кель’Талас от Орды с помощью Альянса Лордерона. Винила себя в гибели младшего брата Лирата. Осталась с войсками Альянса и помогла в конечном итоге выиграть войну. Познакомилась с Туралионом, родила сына и отправилась в Запределье, откуда не смогла вернуться.]],
    },
    {
        era = "Pre-WC3",
        text = [[Путешествовала по Круговерти Пустоты вместе с Туралионом. Вступила в Армию Света для тысячелетней войной с Пылающим Легионом. Встретила Странника и научилась использовать магию Бездны. На короткое время была заключена в тюрьму Зе'рой и Армией Света.]],
    },
    {
        era = "Legion",
        text = [[Узнала больше о Бездне и о том, как противостоять её шёпоту. Была наполнена силой наару Л’уры. Сражалась в финальной битве против Легиона в их крепости Анторус и одержала победу. Вместе с Туралионом воссоединилась со своим сыном, Аратором. Нашла и завербовала изгнанных рен’дорай в Альянс.]],
    },
    {
        era = "Pre-BfA",
        text = [[Вернулась в Луносвет, но была немедленно изгнана, когда её тёмное присутствие едва не осквернило Солнечный Колодец. Встретилась со своими сестрами Верисой и Сильваной, но встреча закончилась ссорой.]],
    },
    {
        era = "BfA",
        text = [[Сражалась в осаде Лордерона против Сильваны. Сражалась за Альянс в Четвёртой войне.]],
    },
    {
        era = "Pre-SL",
        text = [[Возглавила охоту на Сильвану Ветрокрылую. Прибегла к пыткам, чтобы вытянуть информацию из мирных жителей Орды.]],
    },
    {
        era = "SL",
        text = [[Присутствовала на суде над Сильваной в Орибосе.]],
    },
    {
        era = "DF",
        text = [[По просьбе Кадгара начала охоту на Предвестницу, которой оказалась Ксал’атат. Защищала Телогрус вместе со Странником и магистром Умбрием от Тёмной Стражи Ксал’атат.]],
    },
    {
        era = "TWW",
        text = [[Пережила разрушение Даларана и безрассудно преследовала Ксал’атат по всему Каз Алгару и под землёй. Нанесла ущерб Тёмному Сердцу. Неохотно сотрудничала с Ксал’атат и Странником, чтобы победить Пространствуса Всепоглощающего.]],
    },
    {
        era = "Pre-MN",
        text = [[Совместно с Туралионом и Аратором предотвратила возрождение Пылающего Легиона. Приняла предложение о браке от Туралиона, но не могла найти душевного покоя. С тяжёлым сердцем оставила Туралиона у алтаря и не присутствовала на церемонии повышения своего сына. Позже отказалась отправиться в Луносвет с Аратором и вместо этого последовала за Ксал’атат в Бурю Бездны.]],
    },
    {
        era = "Midnight",
        text = [[Возглавила борьбу с Бездной в Буре Бездны. Столкнулась с Ксал’атат в Шпиле Пустоты и поддалась безумию шёпотов в своём уме, обратившись против союзников. Была потеряна в Тёмном Колодце вместе с Туралионом после того, как Ксал’атат вырезала Л’уру из неё.]],
    }
}

IMAGOdb.timelines.MONTE_GAZLOWE = {
    {
        era = "Pre-WC3",
        text = [[Родившийся и выросший в Нижней Шахте, покинул город разочарованным и поклялся никогда не возвращаться. Присоединился к картелю Хитрой Шестеренки вместе со своим старым другом Синем Гогельмогелем.]],
    },
    {
        era = "WC3",
        text = [[Был нанят вождем Траллом для надзора за строительством Оргриммара.]],
    },
    {
        era = "Classic",
        text = [[На деньги, заработанные после завершения строительства Оргриммара, основал портовый город Кабестан в Степях. Будучи благодарным Траллу, продолжал помогать оркам Дуротара, но официально оставался нейтральной фигурой и допускал в свой город как Орду, так и Альянс. Очищал побережье территории Орды от пиратов.]],
    },
    {
        era = "Pre-Cata",
        text = [[Снова получил оплату от Тралла за восстановление Оргриммара после разбушевавшихся элементалей. Помог Бейну Кровавому Копыту в освобождении Громового Утёса, отправив три дирижабля, различных наёмников и огромное количество взрывчатки, приняв лишь умеренную плату.]],
    },
    {
        era = "Cata",
        text = [[Не желая терять прибыль в войне фракций, официально сохранял нейтралитет. Уничтожил груз и корабли Альянса, когда их адмирал попытался перекрыть торговые пути из Оргриммара в Кабестан.]],
    },
    {
        era = "WoD",
        text = [[Был нанят вождём Вол’джином для строительства гарнизона Орды на Хребте Ледяного Огня, а также различных аванпостов и верфи. Поставлял Орде технику в Таладор. Вместе с Телином Тёмной Наковальней помог освободить город Шаттрат от Железной Орды, управляя «Железной звездой». Построил осадную машину, которая разрушила Ворота Танаана.]],
    },
    {
        era = "BfA",
        text = [[Помог принцу Эразмину и Альянсу освободить Мехагон от жестокого правления короля Мехагона. Присоединился к восстанию Саурфанга против Сильваны Ветрокрылой. После бегства Галливикса официально присоединился к Орде в качестве нового торгового принца картеля Трюмных Вод. Был включен в Совет Орды Траллом, который за все эти годы стал его близким другом.]],
    },
    {
        era = "Pre-SL",
        text = [[Пытался решать внутренние проблемы Орды после Четвёртой войны, но был вынужден признать, что охота на Сильвану Ветрокрылую важнее.]],
    },
    {
        era = "Pre-TWW",
        text = [[Заключил сделку с Синем Гогельмогелем об объединении их картелей и обеспечил лучшие условия труда для гоблинов картеля Хитрой Шестерёнки.]],
    },
    {
        era = "TWW",
        text = [[Помогал экспедиции Тайносводья в Аз'кахете и заметил гоблинов Торговой компании поблизости. Работал с Рензиком Ножом и Орвейной, чтобы раскрыть сделку Галливикса с Ксал'атат и освободил Нижнюю Шахту от тирании Галливикса. Вместе с Матиасом Шоу развеял прах Рензика после того, как тот пожертвовал собой ради Газлоу. Вошел в состав нового правящего совета Нижней Шахты.]],
    },
    {
        era = "Midnight",
        text = [[Пообещал Орвейне приехать в Харандар и познакомиться с ее культурой за ее помощь в Нижней Шахте. С наслаждением изучал Хара'ти.]],
    }
}

IMAGOdb.timelines.VALEERA_SANGUINAR = {
    {
        era = "Pre-WC3",
        text = [[Осиротела в детстве, когда всю ее семью убили бандиты. Выживала на улицах, занимаясь воровством.]],
    },
    {
        era = "Pre-WotLK",
        text = [[Была поймана на краже на территории Орды и продана Регару Ярость Земли в качестве рабыни-гладиаторши, где ее заставили сражаться бок о бок с Варианом Ринном и Броллом Медвежья Шкура. Трое подружились и сбежали вместе, в конечном итоге помогла Вариану вернуть трон Штормграда. Короткое время боролась с зависимостью от магии скверны и была одержима демоном Катра'Натиром.]],
    },
    {
        era = "WotLK",
        text = [[Осталась в Штормграде в качестве королевской телохранительницы, чтобы отплатить королю Вариану за спасение жизни. Вместе с Броллом присоединилась к Вариану в битве за Подгород.]],
    },
    {
        era = "Legion",
        text = [[Присоединилась к Некоронованным и помогла вернуть Клыки Пожирателя. Расшифровала последнее сообщение Эмбер Кирнен и раскрыла, что в ШРУ проник Пылающий Легион.]],
    },
    {
        era = "Pre-BfA",
        text = [[Служила Андуину Ринну и доставила сообщение Бейну Кровавому Копыту, инициировав переговоры о проведении собрания.]],
    },
    {
        era = "BfA",
        text = [[Доставляла различные сообщения между враждующими Ордой и Альянсом, выступая в качестве нейтральной стороны для обеих, и присутствовала при формировании Совета Орды.]],
    },
    {
        era = "Pre-SL",
        text = [[Безуспешно пыталась найти следы Сильваны Ветрокрылой. Отказалась участвовать в делах обеих фракций.]],
    },
    {
        era = "TWW",
        text = [[Пережила разрушение Даларана и на некоторое время поселилась вместе с другими Некоронованными в Дорногале.]],
    },
    {
        era = "Midnight",
        text = [[Помогла убить предателя лорда Антенориана. По просьбе как Андуина, так и Лор'темара работала вместе с Реликварием и чемпионами Азерота, чтобы предотвратить различные угрозы Луносвету.]],
    }
}

IMAGOdb.timelines.DECIMUS = {
    {
        era = "Midnight",
        text = [[Заключил альянс с Эльфами Бездны, предоставив им безопасную базу и оказал в поддержку в их вылазках в Буре Бездны. В процессе удачно избавился от других доманааров. Создал Кузню Бездны - проводник темной энергии - для использования его союзниками как источник силы. Все еще не ясно, есть ли у нее другое предназначение.]],
    }
}

IMAGOdb.timelines.LORD_MAXWELL_TYROSUS = {
    {
        era = "Pre-Classic",
        text = [[Присоединился к Александросу Могрейну в его миссии по освобождению Лордерона от Плети. После смерти Могрейна Тиросс решительно выступил против фанатичных идей Алого Ордена, присоединился к недавно основанному Серебряному Рассвету и быстро стал лидером ордена. Позже он помог Дариону Могрейну спасти душу его отца.]],
    },
    {
        era = "Classic",
        text = [[Координировал войска Серебряного Рассвета из Часовни Последней Надежды и сдерживал нежить в Чумных Землях. Помог победить Барона Ривендера в Стратхольме и освободить некогда оживленный город от Плети.]],
    },
    {
        era = "WotLK",
        text = [[Вместе со своим другом Тирионом Фордрингом защищал Часовню Последней Надежды от Дариона Могрейна и его рыцарей смерти. Стал свидетелем освобождения рыцарей смерти от контроля разума Короля-Лича. Объединил Серебряный Рассвет и Рыцарей Серебряной Длани Тириона в новый совместный орден - Серебряный Авангард.]],
    },
    {
        era = "Cata",
        text = [[Продолжал сражаться с Плетью и Культом Проклятых в Чумных Землях.]],
    },
    {
        era = "Legion",
        text = [[Потерял многих товарищей, когда Пылающий Легион уничтожил Серебряный Авангард - в том числе Тириона Фордринга. Сохранил Испепелитель для Серебряной Длани и назвал Чемпиона Света его новым лидером. Позже помог защитить Экзодар и Храм Света Пустоты от Пылающего Легиона.]],
    },
    {
        era = "Pre-MN",
        text = [[С гордостью наградил своего протеже Аратора Ветрокрылого медалью после того, как тот победил демона Саротара и остановил очередное вторжение демонов.]],
    },
    {
        era = "Midnight",
        text = [[Тиросс, как ни парадоксально, не был призван в Кель’Талас. Он сражался с осмелевшими силами Плети в Чумных Землях и, в силу малого количества паладинов в Часовне Последней Надежды, попросил помощи у Рыцарей Чёрного Клинка Дариона Могрейна в сдерживании обороны.]],
    }
}

IMAGOdb.timelines.ALLARI_THE_SOULEATER = {
    {
        era = "TBC",
        text = [[Присягнула на верность Иллидану Ярость Бури в Запределье. По его приказу успешно добыла артефакт «Саргеритский ключ», но по возвращении была схвачена Майев Песнь Теней и заключена в тюрьму вместе с другими Иллидари.]],
    },
    {
        era = "Legion",
        text = [[Была в числе охотников на демонов, освобожденных в качестве последней меры для борьбы с Гул'даном. Помогла восстановить силы Иллидари, захватывая души демонов для восстановления Молота Скверны. Помогла вернуть артефактное оружие Альдарахийские боевые клинки. Помогла вернуть душу Иллидана Ярость Бури и сражалась на его стороне до конца войны.]],
    },
    {
        era = "Pre-MN",
        text = [[Приняла Леону Тенеброд и других желающих рен'дорай в ученики, чтобы научить их пути Иллидари.]],
    },
    {
        era = "Midnight",
        text = [[Сражалась бок о бок с рен'дорай в Буре Бездны.]],
    }
}

IMAGOdb.timelines.L_URA = {
    {
        era = "Ancient",
        text = [[Осталась на Аргусе, чтобы обеспечить побег Велена от Пылающего Легиона. Была побеждена и заключена в тюрьму Кил’джеденом.]],
    },
    {
        era = "Legion",
        text = [[Став тёмным наару, Л’ура своей силой привлекла внимание Тёмной Стражи эфириалов, которые хотели использовать её силу в качестве оружия. В конце концов Аллерия Ветрокрылая и Странник победили эфириалов и покорили Л’уру, а Аллерия поглотила её силы.]],
    },
    {
        era = "Midnight",
        text = [[Была проявлена Аллерией, чтобы убить другого тёмного наару - Т’еру. Была отделена от Аллерии в Шпиле Бездны после поражения последней от рук Ксал’атат. Была использована Ксал’атат, чтобы осквернить Солнечный Колодец. Была убита героями Азерота в Кель’Таласе.]],
    }
}

IMAGOdb.timelines.NEXUS_KING_SALHADAAR = {
    {
        era = "Ancient",
        text = [[Правил народом К'ареша в роли Верховного Жреца и предпочел игнорировать предупреждения Странника о надвигающейся Бездне, в конечном итоге обвинив его в том, что произошло впоследствии. Когда пришел Пространствус, лишился своего физического тела, а К'ареш был разрушен. Бежал со своим народом в Круговерть Пустоты.]],
    },
    {
        era = "TBC",
        text = [[Под предлогом победы над Пространствусом, основал Темную Стражу и отправился на поиски осколков Повелителя Бездны. Превратил некоторых из своих собственных Эфириалов в существ Бездны, прежде чем был убит чемпионами Азерота и восставшими Эфириалами.]],
    },
    {
        era = "TWW",
        text = [[Преобразованный Бездной, командовал войсками Темной Стражи на К'ареше. Почти смог вернуть Пространствуса, прежде чем был вновь побежден. Был захвачен Ксалатат.]],
    },
    {
        era = "Pre-MN",
        text = [[Под угрозой смерти, согласился подчиняться приказам Ксалатат.]],
    },
    {
        era = "Midnight",
        text = [[По приказу Ксалатат, осквернил наару Т'еру Бездной. Был чрезмерно наполнен энергией Бездны и полностью сошел с ума. Сражался с Авангардом Света у Шпиля Бездны. Был наконец убит и с облегчением принял свой конец.]],
    }
}

IMAGOdb.timelines.MOR_DUUN = {
    {
        era = "TWW",
        text = [[Сформировал Сумеречный Клинок из остатков Сумеречного Молота, поклявшись служить Ксал'атат.]],
    },
    {
        era = "Pre-MN",
        text = [[Приказал Сумеречному Клинку вербовать членов в Штормграде и Оргриммаре, пользуясь отчаянием и смятением, вызванными Сияющей Песней.]],
    },
    {
        era = "Midnight",
        text = [[Возглавил штурм Сумеречного Клинка на Зул'Аман, разграбив Атал'Аман и командуя своими армиями с Разрушенного Трона, прежде чем был сражен Зул'Джаррой, Лиадрин и одним из искателей приключений.]],
    }
}

IMAGOdb.timelines.AMARAKK = {
    {
        era = "Pre-TWW",
        text = [[Стал Шул'ка и превратился в изгоя для своего народа. Сражался с порождениями Кошмара в Провале Альн.]],
    },
    {
        era = "Midnight",
        text = [[Помог Орвейне и Герою Азерота отправиться в Провал Альн, чтобы добыть Пыль Альн в качестве оружия против Светоцвета.]],
    }
}